; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v1)
             (pred_6 ?v2 ?v9)
             (pred_7 ?v4 ?v9)
             (pred_1 ?v12 ?v4 )
	     (pred_12 ?v4)
             (pred_9 ?v5)
             (pred_5 ?v2)
             (pred_2 ?v9)
             (pred_8 ?v4)
             (pred_11 ?v2)
             (pred_4 ?v4)
             (pred_10 ))



(:action op_4
:parameters (?v6 ?v8 ?v13 ?v3)
:precondition (and (pred_9 ?v6) (pred_9 ?v8) (pred_5 ?v13) (pred_2 ?v3)
          (pred_3 ?v6 ?v8) (pred_6 ?v13 ?v3)
                   (pred_7 ?v8 ?v3) (pred_12 ?v6) 
                   (pred_8 ?v8) (pred_11 ?v13))
:effect (and  (pred_4 ?v8) (not (pred_8 ?v8))))


(:action op_5
:parameters (?v6 ?v11)
:precondition (and (pred_9 ?v6) (pred_9 ?v11)
               (pred_12 ?v6) (pred_3 ?v6 ?v11) (pred_4 ?v11))
:effect (and (pred_12 ?v11) (not (pred_12 ?v6))))

(:action op_3
:parameters (?v6 ?v13)
:precondition (and (pred_9 ?v6) (pred_5 ?v13) 
                  (pred_12 ?v6) (pred_1 ?v13 ?v6) (pred_10 ))
:effect (and (pred_11 ?v13)
   (not (pred_1 ?v13 ?v6)) (not (pred_10 ))))


(:action op_1
:parameters (?v6 ?v7 ?v10)
:precondition (and (pred_9 ?v6) (pred_5 ?v7) (pred_5 ?v10)
                  (pred_12 ?v6) (pred_11 ?v10) (pred_1 ?v7 ?v6))
:effect (and (pred_11 ?v7) (pred_1 ?v10 ?v6)
        (not (pred_11 ?v10)) (not (pred_1 ?v7 ?v6))))

(:action op_2
:parameters (?v6 ?v13)
:precondition (and (pred_9 ?v6) (pred_5 ?v13) 
                  (pred_12 ?v6) (pred_11 ?v13))
:effect (and (pred_10 ) (pred_1 ?v13 ?v6) (not (pred_11 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_20 obj_06 obj_12 obj_17 obj_18 obj_15 obj_08 obj_13 obj_07 obj_02 obj_16 obj_11 obj_09 obj_14 obj_19
    obj_01 obj_05
    obj_10 obj_03
    )

    (:init
       (pred_10)

       (pred_9 obj_04)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_9 obj_12)
       (pred_9 obj_17)
       (pred_9 obj_18)
       (pred_9 obj_15)
       (pred_9 obj_08)
       (pred_9 obj_13)
       (pred_9 obj_07)
       (pred_9 obj_02)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_05)
       (pred_5 obj_10)
       (pred_5 obj_03)

       (pred_3 obj_04 obj_17)
       (pred_3 obj_04 obj_20)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_20 obj_04)
       (pred_3 obj_06 obj_15)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_08 obj_16)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_07 obj_18)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_16)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_16 obj_19)
       (pred_3 obj_16 obj_08)
       (pred_3 obj_16 obj_02)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_09 obj_14)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_14 obj_09)
       (pred_3 obj_19 obj_16)
       (pred_3 obj_19 obj_14)
       (pred_8 obj_02)
       (pred_8 obj_11)
       (pred_7  obj_02 obj_01)
       (pred_7  obj_11 obj_05)
       (pred_4 obj_04)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_12)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_15)
       (pred_4 obj_08)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_16)
       (pred_4 obj_09)
       (pred_4 obj_14)
       (pred_4 obj_19)

       (pred_6  obj_10 obj_01)
       (pred_6  obj_03 obj_05)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_03 obj_07)
       (pred_12 obj_12)
    )

    (:goal (and
       (pred_1 obj_10 obj_13)
    ))
(:constraints
  (always (not (pred_12 obj_18)))
)
)

; plan
1. (op_5 obj_12 obj_06)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_06)
   goals met: 0 of 1
2. (op_5 obj_06 obj_20)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_20)
   goals met: 0 of 1
3. (op_5 obj_20 obj_04)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_04)
   goals met: 0 of 1
4. (op_5 obj_04 obj_17)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_17)
   goals met: 0 of 1
5. (op_5 obj_17 obj_13)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_13)
   goals met: 0 of 1
6. (op_5 obj_13 obj_07)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_07)
   goals met: 0 of 1
7. (op_3 obj_07 obj_10)
   deleted: (pred_1 obj_10 obj_07) (pred_10)
   added: (pred_11 obj_10)
   goals met: 0 of 1
8. (op_5 obj_07 obj_13)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_13)
   goals met: 0 of 1
9. (op_2 obj_13 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_10) (pred_1 obj_10 obj_13)
   goals met: 1 of 1
